Revit 2027 API
Railing.RailingCanBeHostedByElement Method
 Checks whether the specified element can be used as a host for the railing. The host can be:
stairs
stairs component
ramp
floor
slab edge
wall
roof
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RailingCanBeHostedByElement(
	ElementId hostId
)
Public Function RailingCanBeHostedByElement (
	hostId As ElementId
) As Boolean
public:
bool RailingCanBeHostedByElement(
	ElementId^ hostId
)
member RailingCanBeHostedByElement :
        hostId : ElementId -> bool
Parameters
hostId ElementId
 Element id to check.
Return Value
Boolean
 True if the element can be used as host for the railing.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace